app/controllers/registers_controller.rb

  def index
    # @registers = Register.all
    @registers = Register.where(user_id: current_user.id)
---
SELECT "registers".* FROM "registers" WHERE "registers"."user_id" = $1  [["user_id", 2]]

  def create
    @register = Register.new(register_params)
    @register.user = current_user
    authorize @register

    respond_to do |format|
      if @register.save
---
INSERT INTO "registers" ("roll", "name", "grade", "std", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["roll", 1], ["name", "one"], ["grade", "1"], ["std", 1], ["created_at", "2018-06-26 09:14:15.190579"], ["updated_at", "2018-06-26 09:14:15.190579"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @register.update(register_params)
---
UPDATE "registers" SET "grade" = $1, "updated_at" = $2 WHERE "registers"."id" = $3  [["grade", "Affgf"], ["updated_at", "2018-06-18 16:38:09.715421"], ["id", 1]]

  def destroy
    @register.destroy
---
DELETE FROM "registers" WHERE "registers"."id" = $1  [["id", 1]]

    def set_register
      @register = Register.find(params[:id])
---
SELECT  "registers".* FROM "registers" WHERE "registers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]