app/controllers/registers_controller.rb

  def index
    @registers = Register.all
---
SELECT "registers".* FROM "registers"